SiliconLabs/sdk_support/platform/base/hal/plugin/serial/cortexm/efm32/com.c
/* reload buffer callbacks */
static void updateBuffer(COM_FifoQueue_t *q, uint16_t xferred, uint16_t size)
{
  // Update tail with additional xferred. Data should already be there
  CORE_DECLARE_IRQ_STATE;
  CORE_ENTER_ATOMIC();
  if (xferred > q->pumped) {
    q->head = ((q->head - q->pumped + xferred) % size);
    q->used += xferred - q->pumped;
    q->pumped = xferred;
  }
  CORE_EXIT_ATOMIC();
}

static void txBuffer(COM_Port_t port, uint8_t *data, uint16_t length)
{
#if defined(COM_UART_ENABLE)
  if (checkValidUartPort(port)) {
    COM_Handle_t comhandle = getComHandleFromPort(port);
    // Skip transmit if paused
    if (comhandle->txPaused) {
      comhandle->txCatchUp = true;
      return;
    }
    // Catch up from skipped transmit(s) from before
    if (comhandle->txCatchUp) {
      txCatchUp(comhandle);
    } else if (UARTDRV_Transmit(comhandle->uarthandle, data, length, txCallback) != EMBER_SUCCESS) {
      while (UARTDRV_Transmit(comhandle->uarthandle, data, length, txCallback) != EMBER_SUCCESS) {
      }
    }
  }
#endif
  return;
}

/**
 * VCP-only static functions
 */
#if defined(COM_VCP_ENABLE)
static inline bool checkValidVcpPort(COM_Port_t port)
{
  switch (port) {
#ifdef COM_VCP_ENABLE
    case COM_VCP:
    case comPortVcp:
      return true;
#endif
    default:
      return false;
  }
}

#endif

/**
 * UART-only static functions
 */
#if defined(COM_UART_ENABLE)
static inline bool checkValidLeuartPort(COM_Port_t port)
{
#if (defined(COM_LEUART0_ENABLE) || defined(COM_LEUART1_ENABLE))
  switch (port) {
#ifdef COM_LEUART0_ENABLE
    case COM_LEUART0:
    case comPortLeuart0:
      return true;
#endif
#ifdef COM_LEUART1_ENABLE
    case COM_LEUART1:
    case comPortLeuart1:
      return true;
#endif
    default:
      return false;
  }
#else
  return false;
#endif
}

static inline bool checkValidUartPort(COM_Port_t port)
{
  switch (port) {
#ifdef COM_USART0_ENABLE
    case COM_USART0:
    case comPortUsart0:
      return true;
#endif
#ifdef COM_USART1_ENABLE
    case COM_USART1:
    case comPortUsart1:
      return true;
#endif
#ifdef COM_USART2_ENABLE
    case COM_USART2:
    case comPortUsart2:
      return true;
#endif
#ifdef COM_USART3_ENABLE
    case comPortUsart3:
      return true;
#endif
#ifdef COM_LEUART0_ENABLE
    case COM_LEUART0:
    case comPortLeuart0:
      return true;
#endif
#ifdef COM_LEUART1_ENABLE
    case COM_LEUART1:
    case comPortLeuart1:
      return true;
#endif
    default:
      return false;
  }
}

static void enableRxIrq(COM_Port_t port, bool enable)
{
  COM_Handle_t comhandle = getComHandleFromPort(port);
  IRQn_Type irqn;
  switch (port) {
  #ifdef COM_USART0_ENABLE
    case COM_USART0:
    case comPortUsart0:
      irqn = USART0_RX_IRQn;
      break;
  #endif
  #ifdef COM_USART1_ENABLE
    case COM_USART1:
    case comPortUsart1:
      irqn = USART1_RX_IRQn;
      break;
  #endif
  #ifdef COM_USART2_ENABLE
    case COM_USART2:
    case comPortUsart2:
      irqn = USART2_RX_IRQn;
      break;
  #endif
  #ifdef COM_USART3_ENABLE
    case comPortUsart3:
      irqn = USART3_RX_IRQn;
      break;
  #endif
  #ifdef COM_LEUART0_ENABLE
    case COM_LEUART0:
    case comPortLeuart0:
      irqn = LEUART0_IRQn;
      break;
  #endif
  #ifdef COM_LEUART1_ENABLE
    case COM_LEUART1:
    case comPortLeuart1:
      irqn = LEUART1_IRQn;
      break;
  #endif
    default:
      return;
  }
  if (comhandle->uarthandle->type == uartdrvUartTypeUart) {
    /* Clear previous RX interrupts */
    USART_IntClear(comhandle->uarthandle->peripheral.uart, USART_IF_RXDATAV);
    NVIC_ClearPendingIRQ(irqn);

    if (enable) {
      /* Enable RX interrupts */
      USART_IntEnable(comhandle->uarthandle->peripheral.uart, USART_IF_RXDATAV);
      NVIC_EnableIRQ(irqn);

      USART_Enable(comhandle->uarthandle->peripheral.uart, usartEnable);
    } else {
      /* Disable RX interrupts */
      USART_IntDisable(comhandle->uarthandle->peripheral.uart, USART_IF_RXDATAV);
      NVIC_DisableIRQ(irqn);

      USART_Enable(comhandle->uarthandle->peripheral.uart, usartDisable);
    }
  } else {
#if defined(LEUART_PRESENT)
    /* Clear previous RX interrupts */
    LEUART_IntClear(comhandle->uarthandle->peripheral.leuart, LEUART_IF_RXDATAV);
    NVIC_ClearPendingIRQ(irqn);

    if (enable) {
      /* Enable RX interrupts */
      LEUART_IntEnable(comhandle->uarthandle->peripheral.leuart, LEUART_IF_RXDATAV);
      NVIC_EnableIRQ(irqn);

      LEUART_Enable(comhandle->uarthandle->peripheral.leuart, leuartEnable);
    } else {
      /* Disable RX interrupts */
      LEUART_IntDisable(comhandle->uarthandle->peripheral.leuart, LEUART_IF_RXDATAV);
      NVIC_DisableIRQ(irqn);

      LEUART_Enable(comhandle->uarthandle->peripheral.leuart, leuartDisable);
    }
#endif // LEUART_PRESENT
  }
}

/**
 * @brief Convert a COM_Port_t into a pointer to UART handle
 *
 * @param[in] port COM port number
 *
 * @return Pointer to UART handle
 */
static UARTDRV_Handle_t getUartHandleFromPort(COM_Port_t port)
{
  size_t index;

  switch (port) {
#ifdef COM_USART0_ENABLE
    case COM_USART0:
    case comPortUsart0:
      index = comUartHandleIndexUsart0;
      break;
#endif
#ifdef COM_USART1_ENABLE
    case COM_USART1:
    case comPortUsart1:
      index = comUartHandleIndexUsart1;
      break;
#endif
#ifdef COM_USART2_ENABLE
    case COM_USART2:
    case comPortUsart2:
      index = comUartHandleIndexUsart2;
      break;
#endif
#ifdef COM_USART3_ENABLE
    case comPortUsart3:
      index = comUartHandleIndexUsart3;
      break;
#endif
#ifdef COM_LEUART0_ENABLE
    case COM_LEUART0:
    case comPortLeuart0:
      index = comUartHandleIndexLeuart0;
      break;
#endif
#ifdef COM_LEUART1_ENABLE
    case COM_LEUART1:
    case comPortLeuart1:
      index = comUartHandleIndexLeuart1;
      break;
#endif
    default:
      return NULL;
  }

  return &uarthandledata[index];
}

static void rxCallback(UARTDRV_Handle_t handle,
                       Ecode_t transferStatus,
                       uint8_t *data,
                       UARTDRV_Count_t transferCount)
{
  COM_Handle_t comhandle;

  // Don't process callback if the transfer was aborted
  if (transferStatus == ECODE_EMDRV_UARTDRV_ABORTED) {
    return;
  }

  // Figure out which com port this is
  for (uint8_t i = 0; i < comHandleIndexSize; i++) {
    comhandle = &comhandledata[i];
    if (comhandle->uarthandle == handle) {
      // update fifo
      updateBuffer(comhandle->rxQueue, transferCount, comhandle->rxsize);
      // reset pumped bytes (already in interrupt context)
      comhandle->rxQueue->pumped = 0;
      // set up next receive operation
      // will return current number of rx operations (including current one)
      // Should set up buffers until there will be 2 after this exits
      while (UARTDRV_GetReceiveDepth(handle) < 3) {
        // Do not set up the next buffer if the threshold is already reached
        if (comhandle->rxQueue->used > (comhandle->rxsize - 2 * comhandle->rxStop)) {
          // Apply flow control since next buffer couldn't be allocated
          UARTDRV_FlowControlSet(handle, uartdrvFlowControlOff);
          break;
        }
        rxNextBuffer(comhandle);
      }
    }
  }
}

/* Set up next RX operation (not used for SW flow control) */
static void rxNextBuffer(COM_Handle_t handle)
{
  UARTDRV_Receive(handle->uarthandle,
                  &handle->rxQueue->fifo[handle->bufferIndex * handle->rxStop],
                  handle->rxStop,
                  rxCallback);
  // manually ensure flow control is set after receive
  if (UARTDRV_GetReceiveDepth(handle->uarthandle) >= 2) {
    UARTDRV_FlowControlSet(handle->uarthandle, uartdrvFlowControlOn);
  }
  handle->bufferIndex = (handle->bufferIndex + 1) % handle->bufferLimit;
}

/**
 * Set correct UARTDRV FifoQueues into init struct based on port
 */
static Ecode_t setUartBufferQueues(COM_Port_t port, COM_Init_t * init)
{
  switch (port) {
#ifdef COM_USART0_ENABLE
    case COM_USART0:
    case comPortUsart0:
      init->uartdrvinit.uartinit.rxQueue = (UARTDRV_Buffer_FifoQueue_t *)&comBufferQueueRxUsart0;
      init->uartdrvinit.uartinit.txQueue = (UARTDRV_Buffer_FifoQueue_t *)&comBufferQueueTxUsart0;
      break;
#endif
#ifdef COM_USART1_ENABLE
    case COM_USART1:
    case comPortUsart1:
      init->uartdrvinit.uartinit.rxQueue = (UARTDRV_Buffer_FifoQueue_t *)&comBufferQueueRxUsart1;
      init->uartdrvinit.uartinit.txQueue = (UARTDRV_Buffer_FifoQueue_t *)&comBufferQueueTxUsart1;
      break;
#endif
#ifdef COM_USART2_ENABLE
    case COM_USART2:
    case comPortUsart2:
      init->uartdrvinit.uartinit.rxQueue = (UARTDRV_Buffer_FifoQueue_t *)&comBufferQueueRxUsart2;
      init->uartdrvinit.uartinit.txQueue = (UARTDRV_Buffer_FifoQueue_t *)&comBufferQueueTxUsart2;
      break;
#endif
#ifdef COM_USART3_ENABLE
    case comPortUsart3:
      init->uartdrvinit.uartinit.rxQueue = (UARTDRV_Buffer_FifoQueue_t *)&comBufferQueueRxUsart3;
      init->uartdrvinit.uartinit.txQueue = (UARTDRV_Buffer_FifoQueue_t *)&comBufferQueueTxUsart3;
      break;
#endif
#ifdef COM_LEUART0_ENABLE
    case COM_LEUART0:
    case comPortLeuart0:
      init->uartdrvinit.leuartinit.rxQueue = (UARTDRV_Buffer_FifoQueue_t *)&comBufferQueueRxLeuart0;
      init->uartdrvinit.leuartinit.txQueue = (UARTDRV_Buffer_FifoQueue_t *)&comBufferQueueTxLeuart0;
      break;
#endif
#ifdef COM_LEUART1_ENABLE
    case COM_LEUART1:
    case comPortLeuart1:
      init->uartdrvinit.leuartinit.rxQueue = (UARTDRV_Buffer_FifoQueue_t *)&comBufferQueueRxLeuart1;
      init->uartdrvinit.leuartinit.txQueue = (UARTDRV_Buffer_FifoQueue_t *)&comBufferQueueTxLeuart1;
      break;
#endif
    default:
      return EMBER_ERR_FATAL;
  }
  return EMBER_SUCCESS;
}

static void txCatchUp(COM_Handle_t comhandle)
{
  if (!comhandle->txPaused) {
    uint8_t *fifotail;
    uint8_t length;
    uint8_t *buffer;
    uint32_t sent;
    uint32_t remaining;
    // Get current FIFO head
    fifotail = &comhandle->txQueue->fifo[comhandle->txQueue->tail];
    // Check for active transmit
    UARTDRV_GetTransmitStatus(comhandle->uarthandle, &buffer, &sent, &remaining);
    // Determine bytes to "catch up"
    length = comhandle->txQueue->used - remaining - sent;
    // wrap
    if (comhandle->txQueue->head < comhandle->txQueue->tail) {
      if (UARTDRV_Transmit(comhandle->uarthandle,
                           fifotail,
                           comhandle->txsize - comhandle->txQueue->tail,
                           txCallback)
          != EMBER_SUCCESS) {
        return;
      }
      length -= comhandle->txsize - comhandle->txQueue->tail;
      fifotail = comhandle->txQueue->fifo;
    }
    if (UARTDRV_Transmit(comhandle->uarthandle, fifotail, length, txCallback)
        == EMBER_SUCCESS) {
      comhandle->txCatchUp = false;
    }
  }
}

static void txCallback(UARTDRV_Handle_t handle,
                       Ecode_t transferStatus,
                       uint8_t *data,
                       UARTDRV_Count_t transferCount)
{
  COM_Handle_t comhandle;
  // Figure out which com port this is
  //
  for (uint8_t i = 0; i < comHandleIndexSize; i++) {
    comhandle = &comhandledata[i];
    if (comhandle->uarthandle == handle) {
      dequeueFifoBuffer(comhandle,
                        (transferCount > comhandle->txQueue->used)
                        ? comhandle->txQueue->used
                        : transferCount);
    }
  }
}

