SiliconLabs/sdk_support/platform/base/hal/plugin/serial/cortexm/efm32/com.c
#endif //defined(COM_UART_ENABLE)

#if ((defined(COM_USART0_ENABLE)) \
  || (defined(COM_USART1_ENABLE)) \
  || (defined(COM_USART2_ENABLE)) \
  || (defined(COM_USART3_ENABLE)))

static void COM_RX_IRQHandler(COM_Handle_t comhandle, uint8_t byte)
{
  UARTDRV_FlowControlState_t fcState;
  uint16_t freeSpace;

  // Intercept and handle flow control bytes
  if (byte == UARTDRV_FC_SW_XON) {
    UARTDRV_FlowControlSetPeerStatus(comhandle->uarthandle, uartdrvFlowControlOn);
    comhandle->txPaused = false;
    // Transmit queued data in the TX FIFO queue
    txCatchUp(comhandle);
  } else if (byte == UARTDRV_FC_SW_XOFF) {
    UARTDRV_FlowControlSetPeerStatus(comhandle->uarthandle, uartdrvFlowControlOff);
    comhandle->txPaused = true;
  } else {
    // store byte in RX FIFO only if there is space available
    freeSpace = comhandle->rxsize - comhandle->rxQueue->used;
    if (freeSpace > 0) {
      FIFO_ENQUEUE(comhandle->rxQueue, byte, comhandle->rxsize);
    }
    // Send flow control byte if threshold exceeded
    fcState = UARTDRV_FlowControlGetSelfStatus(comhandle->uarthandle);
    if ((fcState == uartdrvFlowControlOn) && (freeSpace <= comhandle->rxStop)) {
      UARTDRV_FlowControlSet(comhandle->uarthandle, uartdrvFlowControlOff);
    } else if ((fcState == uartdrvFlowControlOff) && (freeSpace >= comhandle->rxStart)) {
      UARTDRV_FlowControlSet(comhandle->uarthandle, uartdrvFlowControlOn);
    }
  }
}

#endif

#ifdef COM_USART0_ENABLE
void USART0_RX_IRQHandler(void)
{
  COM_Handle_t comhandle = getComHandleFromPort(comPortUsart0);
#if (defined(EMBER_AF_NCP) && defined(EMBER_STACK_ZIGBEE) && defined(MICRIUMOS))
  //Wakup the stack task (if it is currently suspended).
  emberRtosStackWakeupIsrHandler();
#endif // (defined(EMBER_AF_NCP) && defined(EMBER_STACK_ZIGBEE) && defined(MICRIUMOS))
  if (comhandle->uarthandle->fcType == uartdrvFlowControlSw) {
    if (USART0->STATUS & USART_STATUS_RXDATAV) {
      COM_RX_IRQHandler(comhandle, USART_Rx(USART0));
    }
  } else {
    USART0->IEN &= ~USART_IEN_RXDATAV;
  }
}
#endif // COM_USART0_ENABLE

#ifdef COM_USART1_ENABLE
void USART1_RX_IRQHandler(void)
{
  COM_Handle_t comhandle = getComHandleFromPort(comPortUsart1);
#if (defined(EMBER_AF_NCP) && defined(EMBER_STACK_ZIGBEE) && defined(MICRIUMOS))
  //Wakup the stack task (if it is currently suspended).
  emberRtosStackWakeupIsrHandler();
#endif // (defined(EMBER_AF_NCP) && defined(EMBER_STACK_ZIGBEE) && defined(MICRIUMOS))

  if (comhandle->uarthandle->fcType == uartdrvFlowControlSw) {
    if (USART1->STATUS & USART_STATUS_RXDATAV) {
      COM_RX_IRQHandler(comhandle, USART_Rx(USART1));
    }
  } else {
    USART1->IEN &= ~USART_IEN_RXDATAV;
  }
}

#endif

#ifdef COM_USART2_ENABLE
void USART2_RX_IRQHandler(void)
{
  COM_Handle_t comhandle = getComHandleFromPort(comPortUsart2);
#if (defined(EMBER_AF_NCP) && defined(EMBER_STACK_ZIGBEE) && defined(MICRIUMOS))
  //Wakup the stack task (if it is currently suspended).
  emberRtosStackWakeupIsrHandler();
#endif // (defined(EMBER_AF_NCP) && defined(EMBER_STACK_ZIGBEE) && defined(MICRIUMOS))

  if (comhandle->uarthandle->fcType == uartdrvFlowControlSw) {
    if (USART2->STATUS & USART_STATUS_RXDATAV) {
      COM_RX_IRQHandler(comhandle, USART_Rx(USART2));
    }
  } else {
    USART2->IEN &= ~USART_IEN_RXDATAV;
  }
}

#endif

#ifdef COM_USART3_ENABLE
void USART3_RX_IRQHandler(void)
{
  COM_Handle_t comhandle = getComHandleFromPort(comPortUsart3);
#if (defined(EMBER_AF_NCP) && defined(EMBER_STACK_ZIGBEE) && defined(MICRIUMOS))
  //Wakup the stack task (if it is currently suspended).
  emberRtosStackWakeupIsrHandler();
#endif // (defined(EMBER_AF_NCP) && defined(EMBER_STACK_ZIGBEE) && defined(MICRIUMOS))

  if (comhandle->uarthandle->fcType == uartdrvFlowControlSw) {
    if (USART3->STATUS & USART_STATUS_RXDATAV) {
      COM_RX_IRQHandler(comhandle, USART_Rx(USART3));
    }
  } else {
    USART3->IEN &= ~USART_IEN_RXDATAV;
  }
}

#endif

/* "power down" COM by switching from DMA to UART byte interrupts in EM1
 *  or to GPIO interrupts otherwise
 */
void COM_InternalPowerDown(bool idle)
{
  if (idle == false) {
    #ifdef COM_USART0_ENABLE
    USART_Enable(USART0, usartDisable);
      #ifdef _SILICON_LABS_32B_SERIES_2 // Reduces sleep current per EMHAL-1791
    GPIO_PinModeSet(BSP_USART0_TX_PORT, BSP_USART0_TX_PIN, gpioModeDisabled, 1);
      #endif
    #endif
    #ifdef COM_USART1_ENABLE
    USART_Enable(USART1, usartDisable);
      #ifdef _SILICON_LABS_32B_SERIES_2 // Reduces sleep current
    GPIO_PinModeSet(BSP_USART1_TX_PORT, BSP_USART1_TX_PIN, gpioModeDisabled, 1);
      #endif
    #endif
    #ifdef COM_USART2_ENABLE
    USART_Enable(USART2, usartDisable);
      #ifdef _SILICON_LABS_32B_SERIES_2 // Reduces sleep current
    GPIO_PinModeSet(BSP_USART2_TX_PORT, BSP_USART2_TX_PIN, gpioModeDisabled, 1);
      #endif
    #endif
    #ifdef COM_USART3_ENABLE
    USART_Enable(USART3, usartDisable);
      #ifdef _SILICON_LABS_32B_SERIES_2 // Reduces sleep current
    GPIO_PinModeSet(BSP_USART3_TX_PORT, BSP_USART3_TX_PIN, gpioModeDisabled, 1);
      #endif
    #endif

    #if (HAL_SERIAL_RXWAKE_ENABLE)
    rxGpioIntEnable();
    #endif
  } else {
    #if HAL_SERIAL_IDLE_WAKE_ENABLE
      #ifdef COM_USART0_ENABLE
    NVIC_ClearPendingIRQ(USART0_RX_IRQn);
    NVIC_EnableIRQ(USART0_RX_IRQn);
    USART_IntEnable(USART0, USART_IF_RXDATAV);
      #endif
      #ifdef COM_USART1_ENABLE
    NVIC_ClearPendingIRQ(USART1_RX_IRQn);
    NVIC_EnableIRQ(USART1_RX_IRQn);
    USART_IntEnable(USART1, USART_IF_RXDATAV);
      #endif
      #ifdef COM_USART2_ENABLE
    NVIC_ClearPendingIRQ(USART2_RX_IRQn);
    NVIC_EnableIRQ(USART2_RX_IRQn);
    USART_IntEnable(USART2, USART_IF_RXDATAV);
      #endif
      #ifdef COM_USART3_ENABLE
    NVIC_ClearPendingIRQ(USART3_RX_IRQn);
    NVIC_EnableIRQ(USART3_RX_IRQn);
    USART_IntEnable(USART3, USART_IF_RXDATAV);
      #endif
    #endif
  }
}

/* "power up" COM by switching back to DMA interrupts */
void COM_InternalPowerUp(bool idle)
{
  if (idle == false) {
    #ifdef COM_USART0_ENABLE
    USART_Enable(USART0, usartEnable);
      #ifdef _SILICON_LABS_32B_SERIES_2 // Re-enable TX GPIO after sleep
    GPIO_PinModeSet(BSP_USART0_TX_PORT, BSP_USART0_TX_PIN, gpioModePushPull, 1);
      #endif
    #endif
    #ifdef COM_USART1_ENABLE
    USART_Enable(USART1, usartEnable);
      #ifdef _SILICON_LABS_32B_SERIES_2 // Re-enable TX GPIO after sleep
    GPIO_PinModeSet(BSP_USART1_TX_PORT, BSP_USART1_TX_PIN, gpioModePushPull, 1);
      #endif
    #endif
    #ifdef COM_USART2_ENABLE
    USART_Enable(USART2, usartEnable);
      #ifdef _SILICON_LABS_32B_SERIES_2 // Re-enable TX GPIO after sleep
    GPIO_PinModeSet(BSP_USART2_TX_PORT, BSP_USART2_TX_PIN, gpioModePushPull, 1);
      #endif
    #endif
    #ifdef COM_USART3_ENABLE
    USART_Enable(USART3, usartEnable);
      #ifdef _SILICON_LABS_32B_SERIES_2 // Re-enable TX GPIO after sleep
    GPIO_PinModeSet(BSP_USART3_TX_PORT, BSP_USART3_TX_PIN, gpioModePushPull, 1);
      #endif
    #endif

    #if (HAL_SERIAL_RXWAKE_ENABLE)
    rxGpioIntDisable();
    #endif
  } else {
    #if HAL_SERIAL_IDLE_WAKE_ENABLE
      #ifdef COM_USART0_ENABLE
    NVIC_ClearPendingIRQ(USART0_RX_IRQn);
    NVIC_DisableIRQ(USART0_RX_IRQn);
      #endif
      #ifdef COM_USART1_ENABLE
    NVIC_ClearPendingIRQ(USART1_RX_IRQn);
    NVIC_DisableIRQ(USART1_RX_IRQn);
      #endif
      #ifdef COM_USART2_ENABLE
    NVIC_ClearPendingIRQ(USART2_RX_IRQn);
    NVIC_DisableIRQ(USART2_RX_IRQn);
      #endif
      #ifdef COM_USART3_ENABLE
    NVIC_ClearPendingIRQ(USART3_RX_IRQn);
    NVIC_DisableIRQ(USART3_RX_IRQn);
      #endif
    #endif
  }
}

/* Inject data into the RX FIFO */
Ecode_t COM_InternalReceiveData(COM_Port_t port, uint8_t *data, uint32_t length)
{
  COM_Handle_t comhandle = getComHandleFromPort(port);
  // Check for space for this message in the FIFO
  if (!getInputFifoSpace(comhandle, length)) {
    return EMBER_ERR_FATAL;
  }

  for (uint32_t i = 0; i < length; i++) {
    CORE_DECLARE_IRQ_STATE;
    CORE_ENTER_ATOMIC();
    FIFO_ENQUEUE(comhandle->rxQueue, *data, comhandle->rxsize);
    CORE_EXIT_ATOMIC();
    data++;
  }

  return EMBER_SUCCESS;
}

bool COM_InternalRxIsPaused(COM_Port_t port)
{
  // UART
#if defined(COM_UART_ENABLE)
  if (checkValidUartPort(port)) {
    COM_Handle_t comhandle = getComHandleFromPort(port);
    return (UARTDRV_FlowControlGetSelfStatus(comhandle->uarthandle) == uartdrvFlowControlOff);
  }
#endif
  return false;
}

