SiliconLabs/sdk_support/platform/base/hal/plugin/serial/cortexm/efm32/com.c
// leuart: return true if txc is true or hastransmitted is false
bool COM_InternalTxIsIdle(COM_Port_t port)
{
  // UART
#if defined(COM_UART_ENABLE)
  if (checkValidUartPort(port)) {
    COM_Handle_t comhandle = getComHandleFromPort(port);
    if ((UARTDRV_GetPeripheralStatus(comhandle->uarthandle) & UARTDRV_STATUS_TXIDLE)
        && (comhandle->txQueue->used == 0)
        && (UARTDRV_GetTransmitDepth(comhandle->uarthandle) == 0)) {
      #ifdef COM_USART_ENABLE
      if (comhandle->uarthandle->type == uartdrvUartTypeUart) {
        // in USART cases check the TXBUFCNT register as well as TXIDLE: EMHAL-2028
        return ((UARTDRV_GetPeripheralStatus(comhandle->uarthandle) & _USART_STATUS_TXBUFCNT_MASK) == 0);
      }
      #endif // COM_USART_ENABLE

      #ifdef COM_LEUART_ENABLE
      if (comhandle->uarthandle->type == uartdrvUartTypeLeuart) {
        // in LEUART cases check if TXC is flagged, as long as we have already transmitted
        return ((UARTDRV_GetPeripheralStatus(comhandle->uarthandle) & UARTDRV_STATUS_TXC)
                || !(comhandle->uarthandle->hasTransmitted));
      }
    #endif // COM_LEUART_ENABLE
    }
  }
#endif // COM_UART_ENABLE
  return false;
}

bool COM_InternalTxIsPaused(COM_Port_t port)
{
  COM_Handle_t comhandle = getComHandleFromPort(port);
  return comhandle->txPaused;
}

//------------------------------------------------------
// Serial initialization

Ecode_t COM_Init(COM_Port_t port, COM_Init_t *init)
{
  if (checkValidPort(port) == false) {
    return EMBER_ERR_FATAL;
  }
  if (!COM_Unused(port)) {
    // Port already configured; reinitialize
    COM_DeInit(port);
  }

  COM_Handle_t comhandle = getComHandleFromPort(port);

  if (setComHandleQueues(port) != EMBER_SUCCESS) {
    return EMBER_ERR_FATAL;
  }

  // VCP
#if (COM_VCP_PORTS > 0) && defined(COM_VCP_ENABLE)
  if (checkValidVcpPort(port)) {
    return emDebugInit();
  }
#endif

  // UART
#if defined(COM_UART_ENABLE)
  if (checkValidUartPort(port)) {
    Ecode_t status;

    comhandle->uarthandle = getUartHandleFromPort(port);

    // add rx/tx buffer queue to initdata
    if (setUartBufferQueues(port, init) != EMBER_SUCCESS) {
      return EMBER_ERR_FATAL;
    }

    // store RX flow control thresholds
    comhandle->rxStop = init->rxStop;
    comhandle->rxStart = init->rxStart;

    if (!checkValidThresholds(comhandle)) {
      // Reset COM handle
      memset(comhandle, 0, sizeof(COM_HandleData_t));
      return EMBER_BAD_ARGUMENT;
    }

    // iniitalize hardware
    if (checkValidLeuartPort(port)) {
#if defined(LEUART_PRESENT)
      status = UARTDRV_InitLeuart(comhandle->uarthandle, &init->uartdrvinit.leuartinit);
#endif // LEUART_PRESENT
    } else { //USART
      status = UARTDRV_InitUart(comhandle->uarthandle, &init->uartdrvinit.uartinit);
    }
    if (status != EMBER_SUCCESS) {
      return status;
    }
    GPIO_PinModeSet(comhandle->uarthandle->rxPort,
                    comhandle->uarthandle->rxPin,
                    gpioModeInputPull,
                    1);

    if (
      #if defined(LEUART_PRESENT)
      (checkValidLeuartPort(port)
       && (init->uartdrvinit.leuartinit.fcType == uartdrvFlowControlSw))
      ||
      #endif // LEUART_PRESENT
      (!checkValidLeuartPort(port)
       && (init->uartdrvinit.uartinit.fcType == uartdrvFlowControlSw))) {
      enableRxIrq(port, true);
      // begin by sending XON
      UARTDRV_FlowControlSet(comhandle->uarthandle, uartdrvFlowControlOn);
    } else {
      comhandle->bufferIndex = 0;
      comhandle->bufferLimit = comhandle->rxsize / comhandle->rxStop;

      // start ping pong buffers for FIFO
      rxNextBuffer(comhandle);
      rxNextBuffer(comhandle);
    }
  }
#endif // COM_UART_ENABLE
  COM_RxGpioWakeInit();

  return EMBER_SUCCESS;
}

Ecode_t COM_DeInit(COM_Port_t port)
{
  COM_Handle_t comhandle;
  Ecode_t status;

  if (checkValidPort(port) == false) {
    return EMBER_ERR_FATAL;
  }
  if (COM_Unused(port)) {
    return EMBER_SUCCESS;
  }

  COM_FlushRx(port);

  comhandle = getComHandleFromPort(port);

#if defined(COM_UART_ENABLE)
  if (checkValidUartPort(port)) {
    status = UARTDRV_DeInit(comhandle->uarthandle);
    if (status != ECODE_EMDRV_UARTDRV_OK) {
      return status;
    }

    if (comhandle->uarthandle->fcType == uartdrvFlowControlSw) {
      enableRxIrq(port, false);
    }
#if (HAL_SERIAL_RXWAKE_ENABLE)
    rxGpioIntDisable();
#endif
  }
#endif
  memset(comhandle, 0, sizeof(COM_HandleData_t));
  return EMBER_SUCCESS;
}

//------------------------------------------------------
// Serial Input

// returns # bytes available for reading
uint16_t COM_ReadAvailable(COM_Port_t port)
{
  COM_Handle_t comhandle = getComHandleFromPort(port);
  // make sure rx buffer is updated
  pumpRx(port);
  return comhandle->rxQueue->used;
}

Ecode_t COM_ReadByte(COM_Port_t port, uint8_t *dataByte)
{
  if (checkValidPort(port) == false) {
    return EMBER_ERR_FATAL;
  }
  COM_Handle_t comhandle = getComHandleFromPort(port);
  // make sure rx buffer is updated
  pumpRx(port);
  if (comhandle->rxQueue->used > 0) {
    CORE_DECLARE_IRQ_STATE;
    CORE_ENTER_ATOMIC();
    *dataByte = FIFO_DEQUEUE(comhandle->rxQueue, comhandle->rxsize);

      #ifdef COM_UART_ENABLE
    if (checkValidUartPort(port)
        && comhandle->uarthandle->fcType != uartdrvFlowControlSw) {
      while (UARTDRV_GetReceiveDepth(comhandle->uarthandle) < 2) {
        // Do not set up the next buffer if the threshold is already reached
        if (comhandle->rxQueue->used > (comhandle->rxsize - 2 * comhandle->rxStop)) {
          break;
        }
        rxNextBuffer(comhandle);
      }
    }
      #endif //COM_UART_ENABLE
    CORE_EXIT_ATOMIC();
    return EMBER_SUCCESS;
  }
  return EMBER_SERIAL_RX_EMPTY;
}

Ecode_t COM_ReadData(COM_Port_t port,
                     uint8_t *data,
                     uint16_t length,
                     uint16_t *bytesRead)
{
  if (checkValidPort(port) == false) {
    return EMBER_ERR_FATAL;
  }
  uint16_t bytesReadInternal = 0;
  Ecode_t status;

  while (bytesReadInternal < length) {
    status = COM_ReadByte(port, data);

    switch (status) {
      case EMBER_SUCCESS:
        ++data;
        ++bytesReadInternal;
        break;

      case EMBER_SERIAL_RX_EMPTY:
        // empty queue is not an error for us, we just want to keep waiting
        break;

      default:
        // only store number of bytes read if the caller provided a non-NULL pointer
        if (bytesRead) {
          *bytesRead = bytesReadInternal;
        }
        return status;
    }
  }

  // only store number of bytes read if the caller provided a non-NULL pointer
  if (bytesRead) {
    *bytesRead = bytesReadInternal;
  }

  return EMBER_SUCCESS;
}

#ifndef EMBER_TEST
Ecode_t COM_ReadDataTimeout(COM_Port_t port,
                            uint8_t *data,
                            uint16_t length,
                            uint16_t *bytesRead,
                            uint16_t firstByteTimeout,
                            uint16_t subsequentByteTimeout)
{
  if (checkValidPort(port) == false) {
    return EMBER_ERR_FATAL;
  }
  uint16_t bytesReadInternal = 0;
  Ecode_t status;
  uint16_t timeout = firstByteTimeout;
  uint16_t startTime = halCommonGetInt16uMillisecondTick();

  // loop until we read the max number of bytes or the timeout elapses
  while (bytesReadInternal < length
         && elapsedTimeInt16u(startTime, halCommonGetInt16uMillisecondTick()) < timeout) {
    status = COM_ReadByte(port, data);

    switch (status) {
      case EMBER_SUCCESS:
        ++data;
        ++bytesReadInternal;
        // reset timer and timeout for next character
        startTime = halCommonGetInt16uMillisecondTick();
        timeout = subsequentByteTimeout;
        break;

      case EMBER_SERIAL_RX_EMPTY:
        // empty queue is not an error for us, we just want to keep waiting
        break;

      default:
        // only store number of bytes read if the caller provided a non-NULL pointer
        if (bytesRead) {
          *bytesRead = bytesReadInternal;
        }
        return status;
    }
  }

  // only store number of bytes read if the caller provided a non-NULL pointer
  if (bytesRead) {
    *bytesRead = bytesReadInternal;
  }

